<?php

use Illuminate\Database\Seeder;

class DescriptionTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('description_question')->insert([
            'dq_q_id' => '1',
            'dq_discription' => 'รักษาความลับของบริษัท, เพื่อนร่วมงานและลูกค้าโดยไม่นําข้อมูลสำคัญไป เปิดเผยให้ผู้อื่นรับรู้ ปฏิบัติตามระเบียบและกฎเกณฑ์ของบริษัทร่วมถึงการตรงต่อเวลาในการทำงานและนัดหมายต่างๆ เมื่อกระทำผิดต้องยอมรับผิดในงานที่ตนรับผิดชอบ โดยไม่กล่าวโทษผู้อื่น ให้ข้อมูลหรือคําแนะนําที่ถูกต้องและเป็นประโยชน์แก่ผู้บังคับบัญชา,เพื่อนร่วมงาน และลูกค้า',
        ]);
        DB::table('description_question')->insert([
            'dq_q_id' => '2',
            'dq_discription' => 'รักในงานที่ทำ มองแง่มุมที่ดีของเพื่อนร่วมงานและเจ้านายเสมอ เชื่อว่าทุกสิ่งเป็นไปได้และเราทำได้ ไม่มองอุปสรรคคือปัญหาแต่มองว่าเป็นการเรียนรู้',
        ]);
        DB::table('description_question')->insert([
            'dq_q_id' => '3',
            'dq_discription' => 'ประหยัดทรัพยากรของบริษัท และของส่วนรวม มีความพอเพียง รู้จักคำว่าพอและบริหารจัดการการใช้ทรัพยากรได้อย่างคุ้มค่าที่มีอยู่',
        ]);
        DB::table('description_question')->insert([
            'dq_q_id' => '4',
            'dq_discription' => 'มีความมุ่งมั่นในการทำงานให้สำเร็จ ตรงตามรายละเอียดงานและเวลาที่กำหนด มีการวางแผนการทำงานเพื่อให้บรรลุถึงเป้าหมายที่ตั้งไว้',
        ]);
        DB::table('description_question')->insert([
            'dq_q_id' => '5',
            'dq_discription' => 'มีความต้องการที่จะเรียนรู้เพิ่มเติมอยู่เสมอเพื่อพัฒนาศักยภาพและความสามารถของตัวเอง หมั่นหาความรู้และข้อมูลที่เป็นประโยชน์กับงานให้ตัวเองได้เรียนรู้อยู่เสมอ',
        ]);
        DB::table('description_question')->insert([
            'dq_q_id' => '6',
            'dq_discription' => 'เปิดใจรับฟังผู้บังคับบัญชา, ผู้ใต้บังคับบัญชา และเพื่อนร่วมงาน เพื่อเป็นแนวทางในการปรับปรุงและแก้ไขพัฒนาตนเองอยู่เสมอ ',
        ]);
        DB::table('description_question')->insert([
            'dq_q_id' => '7',
            'dq_discription' => 'มีจิตอาสา ช่วยเหลือ เกื้อกูล ทีมงาน เพื่อนร่วมงาน และผู้อื่นอยู่เสมอ',
        ]);
        DB::table('description_question')->insert([
            'dq_q_id' => '8',
            'dq_discription' => 'มีความคิดใหม่ๆ นำเสนอนวัฒกรรมใหม่ๆ เพื่อพัฒนางานและเพิ่มมูลค่าของงานให้เป็นประโยชน์ต่อส่วนรวมอยู่เสมอ ',
        ]);
        DB::table('description_question')->insert([
            'dq_q_id' => '10',
            'dq_discription' => 'สามารถใช้ความชำนาญในการพัฒนาการทำงานของตน สามารถแสดงความคิดเห็นหรือคำแนะนำในงานได้อย่างน่าเชื่อถือ เต็มใจแบ่งปันและถ่ายทอดความรู้',
        ]);
        DB::table('description_question')->insert([
            'dq_q_id' => '11',
            'dq_discription' => 'สามารถลงมือปฏิบัติงานตามแผนได้อย่างสำเร็จ สามารถระบุประเด็นปัญหาและสาเหตุ พร้อมทั้งสามารถนำเสนอแนวทางการแก้ไขปัญหานั้นๆ ได้ มีความกระตือรือร้นและมุ่งมั่นที่จะทำงานให้สำเร็จอย่างสม่ำเสมอ',
        ]);
        DB::table('description_question')->insert([
            'dq_q_id' => '12',
            'dq_discription' => 'สามารถวิเคราะห์ความต้องการของผู้บังคับบัญชา และผู้รับบริการทุกระดับ (ทั้งภายในและภายนอก) สามารถสร้างและรักษาความสัมพันธ์ที่ดีกับผู้บังคับบัญชา และผู้รับบริการทุกระดับ (ทั้งภายในและภายนอก) ตอบสนองความต้องการของผู้บังคับบัญชา และผู้รับบริการทุกระดับ (ทั้งภายในและภายนอก) ด้วยความรวดเร็ว พร้อมทั้งสามารถเสนอทางเลือกต่างๆ ในการแก้ไขปัญหา',
        ]);
        DB::table('description_question')->insert([
            'dq_q_id' => '13',
            'dq_discription' => 'สามารถสื่อสารทั้งการพูดและเขียนได้อย่างชัดเจน ถูกต้อง และกระชับได้ใจความ สามารถใช้สื่อต่างๆ ในการสื่อสารได้อย่างเหมาะสมกับสถานการณ์ เช่น การประชุม พบปะ การใช้อีเมล์ เป็นต้น สามารถสื่อสารด้วยความมั่นใจ (เช่น มีความพร้อมในด้านข้อมูล มีการเตรียมตัวและการจัดการที่ดี)',
        ]);
        DB::table('description_question')->insert([
            'dq_q_id' => '15',
            'dq_discription' => 'สามารถส่งเสริมและผลักดันให้เกิดการพัฒนาปรับเปลี่ยนแนวทางการทำงานให้ดีขึ้น เปิดใจยอมรับและมีความยืดหยุ่นต่อการเปลี่ยนแปลง ให้การสนับสนุนด้านทรัพยากร แก้ไขปัญหาและอุปสรรค พร้อมทั้งแสดงบทบาทในฐานะเป็นผู้ประสานงานสำหรับการเปลี่ยนแปลง',
        ]);
        DB::table('description_question')->insert([
            'dq_q_id' => '16',
            'dq_discription' => 'สามารถแสดงออกซึ่งความรู้ในธุรกิจและทักษะที่ต้องการในการดำเนินธุรกิจตั้งแต่การวางแผนติดต่อสื่อสาร และการปฏิบัติงานตามแผน  สามารถนำเสนอความคิดที่สร้างสรรค์ พร้อมทั้งสามารถมองเห็นโอกาสและแนวทางในการปรับปรุงงานได้ในเชิงธุรกิจ สามารถมองเห็นภาพรวมของความสัมพันธ์ขององค์ประกอบต่างๆ ทางธุรกิจได้ (เช่น เข้าใจและวิเคราะห์ผลกระทบทางธุรกิจ ในลักษณะของแผนปฏิบัติงานหรือข้อเสนอแนะ) ',
        ]);
        DB::table('description_question')->insert([
            'dq_q_id' => '17',
            'dq_discription' => 'สามารถวางแผนและปฏิบัติงาน โดยตระหนักถึงความคุ้มค่าและประสิทธิภาพทางการเงิน (ROI) สามารถบริหารผลงานและงบประมาณที่จัดทำไว้ได้อย่างมีประสิทธิภาพและประสิทธิผล รักษาความสมดุลระหว่างความสำคัญของการบริหารต้นทุนค่าใช้จ่ายและความสำคัญของการบริหารความเสี่ยงในการปฏิบัติงานประจำวัน',
        ]);
        DB::table('description_question')->insert([
            'dq_q_id' => '18',
            'dq_discription' => 'สามารถกำหนดเป้าหมายที่ท้าทายและวัดผลได้สำหรับทีมงาน และพยายามดำเนินการให้บรรลุเป้าหมาย จัดทำแผนปฏิบัติการ (Action Plan) บนพื้นฐานของข้อมูลและประสบการณ์ที่เกิดขึ้นในแต่ละแผนงานได้ สามารถปรับเปลี่ยนแผนงานให้สอดคล้องกับเป้าหมาย และแนวความคิดที่สามารถแก้ปัญหาได้',
        ]);
        DB::table('description_question')->insert([
            'dq_q_id' => '19',
            'dq_discription' => 'พิจารณาทบทวนผลงานของสมาชิกในทีม พร้อมทั้งชี้แจงสมาชิกให้ทราบถึงความสำเร็จของทีมและของสมาชิกแต่ละคนอย่างสม่ำเสมอ ฝึกสอนและพัฒนาพนักงานให้มีความรู้และทักษะที่จำเป็นในการทำงาน พยายามสร้างและนำศักยภาพในตัวพนักงานมาใช้อย่างเต็มที่ ',
        ]);
        DB::table('description_question')->insert([
            'dq_q_id' => '20',
            'dq_discription' => 'มองปัญหารอบด้านก่อนตัดสินใจ โดยสามารถถ่วงน้ำหนักความเสี่ยงไว้ด้วย รวบรวมข้อมูลและนำเสนอแนวทางการแก้ไขปัญหาอย่างเป็นขั้นตอน สามารถตัดสินใจ โดยมีข้อมูลประกอบเสมอ และพร้อมรับผิดชอบต่อการกระทำหรือการตัดสินใจของตน',
        ]);
        DB::table('description_question')->insert([
            'dq_q_id' => '21',
            'dq_discription' => 'สามารถโน้มน้าวให้เกิดการปฏิบัติโดยมีหลักการและเหตุผล สามารถนำเสนอความคิดของตนและโน้มน้าวให้เกิดการปฏิบัติร่วมกัน สามารถแสดงความเห็นที่อาจไม่ตรงกับผู้อื่นโดยไม่ได้มุ่งเน้นการโจมตีหรือให้ร้ายผู้ปฏิบัติงาน สามารถปฏิบัติงานให้สำเร็จโดยที่แต่ละฝ่ายที่เกี่ยวข้องได้ประโยชน์และสามารถรักษาความสัมพันธ์อันดีไว้ แสดงความสามารถในการควบคุมในการคลี่คลายความขัดแย้งต่างๆ',
        ]);
        DB::table('description_question')->insert([
            'dq_q_id' => '23',
            'dq_discription' => 'สามารถอำนวยการและประสานงานให้สมาชิกในทีมงานมีส่วนร่วมในการกำหนดเป้าหมายการวางแผนการปฏิบัติงาน ตลอดจนการตัดสินใจร่วมกัน สามารถแสดงบทบาทในฐานะสมาชิกในทีมหรือหัวหน้าทีมได้ดี เช่น การแสดงความคิดเห็น การสนับสนุนสมาชิกคนอื่นๆ ภายในทีมงาน สามารถสื่อสาร ให้คำแนะนำ และให้ความช่วยเหลือ เพื่อให้เกิดความปรองดองกันภายในทีมงาน พยายามทำงานร่วมกับผู้อื่นอย่างใกล้ชิดเพื่อแบ่งปันข้อมูลในการทำงานซึงกันและกัน',
        ]);
        DB::table('description_question')->insert([
            'dq_q_id' => '24',
            'dq_discription' => 'สามารถจัดการกับสถานการณ์ที่บีบคั้นหรือเคร่งเครียดด้วยความสุขุมและมั่นใจ สามารถควบคุมหรือระงับอารมณ์ของตนได้ พิจารณาทางเลือกในเชิงบวกอื่นๆ ได้เมื่อเผชิญหน้ากับวิกฤตการณ์',
        ]);
        DB::table('description_question')->insert([
            'dq_q_id' => '25',
            'dq_discription' => 'กำหนดมาตรฐานการทำงานของตนและสามารถปฏิบัติได้ แสดงความกระตือรือร้นและพร้อมที่จะเรียนรู้สิ่งใหม่ๆ แสดงความตั้งใจที่จะพัฒนาตนเอง',
        ]);
        
        
    }
}
