<?php

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;
class TestTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('tb_choice')->insert([
            'question' => '1.ข้าพเจ้าชอบที่จะ',
            'choice1' => 'ก.แก้ปัญหาใหม่ๆที่มีความสลับซับซ้อน',
            'choice2' => 'ข.เลือทำงานที่เคยทำสำเร็จมาแล้ว',
            'answer1' => 'ก',
            'answer2' => 'ข'
        ]);
        DB::table('tb_choice')->insert([
            'question' => '2.ข้าพเจ้าชอบที่จะ',
            'choice1' => 'ก.ทำงานตามลำพังในที่สงบเงียบ',
            'choice2' => 'ข.อยู่ตรงที่งานกำลังดำเนินอยู่',
            'answer1' => 'ก',
            'answer2' => 'ข'
        ]);
        DB::table('tb_choice')->insert([
            'question' => '3.ข้าพเจ้าชอบหัวหน้าที่',
            'choice1' => 'ก.ได้สร้างและกำหนดเกณฑ์การทำงานและการตัดสินใจไว้ให้แล้ว',
            'choice2' => 'ข.ใส่ใจต่อความต้องการและช่วยเหลือลูกน้องรายบุคคล',
            'answer1' => 'ก',
            'answer2' => 'ข'
        ]);
        DB::table('tb_choice')->insert([
            'question' => '4.เมื่อข้าพเจ้าทำงานเกี่ยวกับโครงการ ข้าพเจ้าต้องการ... ',
            'choice1' => 'ก.ทำให้เสร็จและปิดโครงการทันที่',
            'choice2' => 'ข.ไม่รีบปิดโครงการเผื่อไว้หากต้องปรับปรุงเปลี่ยนแปลง',
            'answer1' => 'ก',
            'answer2' => 'ข'
        ]);
        DB::table('tb_choice')->insert([
            'question' => '5.เมื่อต้องตัดสินใจ สิ่งสำคัญที่สุดที่ต้องคำนึงถึง คือ ',
            'choice1' => 'ก.การคิดเชิงเหตุผล การมีข้อมูลและความคิดเห็น',
            'choice2' => 'ข.ความรู้สึกและค่านิยมของคน',
            'answer1' => 'ก',
            'answer2' => 'ข'
        ]);
        DB::table('tb_choice')->insert([
            'question' => '6.เมื่อต้องทำงานโครงการ ข้าพเจ้าจะ',
            'choice1' => 'ก.คิดทบทวนหลายคร้งก่อนที่ตัดสินใจว่าจะเริ่มดำเนินการอย่างไร',
            'choice2' => 'ข.เริ่มต้นลงมือทำงานทันที พร้อมกับคิดไปทำไปที่ละขั้น',
            'answer1' => 'ก',
            'answer2' => 'ข'
        ]);
        DB::table('tb_choice')->insert([
            'question' => '7.เมื่อต้องทำงานโครงการ ข้าพเจ้าจะรอบที่จะ...',
            'choice1' => 'ก.คงวิธีการควบคุมให้มากที่สุดเท่าที่จะเป็นไปได้',
            'choice2' => 'ข.ตรวจสอบหาแนวทางต่างๆ ที่สามารถนำไปดำเนินการได้',
            'answer1' => 'ก',
            'answer2' => 'ข'
        ]);
        DB::table('tb_choice')->insert([
            'question' => '8.ในการทำงานของข้าพเจ้า ข้าพเจ้ามักจะ... ',
            'choice1' => 'ก.ทำพร้อมกันหลายโครงการ และพยายามหาความรู้จากแต่ละโครงการให้มากที่สุดเท่าที่จะทำได้',
            'choice2' => 'ข.เลือกโครงการที่มีความท้าทายมากที่สุดเพียงโครงการเดียวและจะทุ่มเทอย่างเต็มที่',
            'answer1' => 'ก',
            'answer2' => 'ข'
        ]);
        DB::table('tb_choice')->insert([
            'question' => '9.ข้าพเจ้ามักจะ..',
            'choice1' => 'ก.จัดทำรายการและแผนการทำงงานก่อนที่จะเริ่มต้นการทำงาน และไม่พอใจอย่างยิ่งถ้าถูกปรับเปลี่ยนไปจากแผนที่กำหนดไว้นี้',
            'choice2' => 'ข.หลีกเลี่ยงการทำแผนแต่ละปล่อยให้งานคืบหน้าไปเองขณะที่ทำงานนั้น',
            'answer1' => 'ก',
            'answer2' => 'ข'
        ]);
        DB::table('tb_choice')->insert([
            'question' => '10.เมื่ออภิปรายปัญหากับเพื่อน ข้าพเจ้าสามารถ...',
            'choice1' => 'ก.มองเห็นภาพรวมได้โดยง่าย',
            'choice2' => 'ข.เข้าใจจุดใดจุดหนึ่งของสถานการณ์นั้นได้อย่างลึกซึ้งได้โดยง่าย',
            'answer1' => 'ก',
            'answer2' => 'ข'
        ]);
        DB::table('tb_choice')->insert([
            'question' => '11.เมื่อมีกริ่งโทรศัพท์ดังขึ้นที่ทำงานหรือที่บ้าน ปกติข้าพเจ้า ',
            'choice1' => 'ก.รู้สึกว่าเป็นเสียงรบกวนการทำงาน',
            'choice2' => 'ข.ไม่รังเกียจที่จะรับสายโทรศัพท์นั้น',
            'answer1' => 'ก',
            'answer2' => 'ข'
        ]);
        DB::table('tb_choice')->insert([
            'question' => '12.คำใดที่อธิบายตรงกับตัวข้าพเจ้าได้ดีกว่ากัน ระหว่าง... ',
            'choice1' => 'ก.การวิเคราะห์(Analytical)',
            'choice2' => 'ข.ความเข้าอกเข้าใจ(Empathetic)',
            'answer1' => 'ก',
            'answer2' => 'ข'
        ]);
        DB::table('tb_choice')->insert([
            'question' => '13.เมื่อข้าพเจ้าลงมือทำการบ้าน ข้าพเจ้ามักจะ...',
            'choice1' => 'ก.ทำอย่างสม่ำเสมอและคงเส้นคงวา',
            'choice2' => 'ข.ทำอย่างเต็มที่แต่มีช่วงหยุดเป็นช่วงๆ',
            'answer1' => 'ก',
            'answer2' => 'ข'
        ]);
        DB::table('tb_choice')->insert([
            'question' => '14.เมื่อข้าพเจ้าเกิดได้ยินใครพูดถึงเรื่องใดเรื่องหนึ่ง ข้าพเจ้ามักจะพยายาม... ',
            'choice1' => 'ก.นำมาเกี่ยวข้องกับประสบการณ์เก่าของข้าพเจ้าและดูว่าคล้ายกันไหม',
            'choice2' => 'ข.วิเคราะห์และประเมินเนื้อหาที่ได้ยินนั้น',
            'answer1' => 'ก',
            'answer2' => 'ข'
        ]);
        DB::table('tb_choice')->insert([
            'question' => '15.เมื่อข้าพเจ้าเกิดความคิดใหม่ขึ้น ข้าพเจ้มักจะ... ',
            'choice1' => 'ก.ลงมือทำดู',
            'choice2' => 'ข.ลองพิจารณาใคร่ครวญความคิดใหม่นั้นอีกหลายครั้ง',
            'answer1' => 'ก',
            'answer2' => 'ข'
        ]);
        DB::table('tb_choice')->insert([
            'question' => '16.เมื่อต้องการทำงานโครงการ ข้าพเจ้ามักจะ... ',
            'choice1' => 'ก.ตีกรอบงานให้แคบลง เพื่อที่จะมองเห็นภาพได้ชัดเจนและตรงประเด็นยิ่งขึ้น',
            'choice2' => 'ข.ขยายขอบเขตงานออกไปเพื่อให้สามารถครอบคลุมประเด็นที่เกี่ยวข้องได้ครบ',
            'answer1' => 'ก',
            'answer2' => 'ข'
        ]);
        DB::table('tb_choice')->insert([
            'question' => '17.เมื่อข้าพเจ้าอ่านอะไรก็แล้วแต่ ข้าพเจ้ามักจะ... ',
            'choice1' => 'ก.เพ่งความคิดไปยังข้อความที่เขียนนั้น',
            'choice2' => 'ข.อ่านแต่ละบรรทัด เพื่อหาความสำคัญที่เกี่ยวข้องกับความคิดต่างๆ',
            'answer1' => 'ก',
            'answer2' => 'ข'
        ]);
        DB::table('tb_choice')->insert([
            'question' => '18.เมื่อข้าพเจ้าจำเป็นต้องตัดสินใจโดนเร่งด่วน ข้าพเจ้ามักจะ... ',
            'choice1' => 'ก.รู้สึกอีดอัดใจและอยากได้ข้อมูลเพิ่มเติม',
            'choice2' => 'ข.สามารถตัดสินใจได้จากข้อมูลเท่าที่มีอยู่',
            'answer1' => 'ก',
            'answer2' => 'ข'
        ]);
        DB::table('tb_choice')->insert([
            'question' => '19.ในการประชุม ข้าพเจ้ามักจะ... ',
            'choice1' => 'ก.ค่อยๆ ไประมวลความคิดตนเองในขณะที่พูดถึงเรื่องนั้น',
            'choice2' => 'ข.พูดออกไปก็ต่อเมื่อได้ใคร่ครวญความคิดเกี่ยวกับเรื่องนั้นอย่างดีแล้ว',
            'answer1' => 'ก',
            'answer2' => 'ข'
        ]);
        DB::table('tb_choice')->insert([
            'question' => '20.ในการทำงาน ประเด็นที่ข้าพเจ้าชอบช้เวลาค่อนข้างมากกว่า คือ ',
            'choice1' => 'ก.ประเด็นที่เกี่ยวกับความคิด',
            'choice2' => 'ข.ประเด็นที่เกี่ยวกับคน',
            'answer1' => 'ก',
            'answer2' => 'ข'
        ]);
        DB::table('tb_choice')->insert([
            'question' => '21.ในการประชุม ข้าพเจ้ามักถูกรบกวนให้รำคาญใจกับคนที่... ',
            'choice1' => 'ก.ชอบเสนอความคิดมากมายที่ยังขาดความชัดเจน',
            'choice2' => 'ข.ทำให้เสียเสลาที่ประชุมไปกับการพูดถึงรายละเอียดของการทำงานอย่างถี่ยิบ',
            'answer1' => 'ก',
            'answer2' => 'ข'
        ]);
        DB::table('tb_choice')->insert([
            'question' => '22.ข้าพเจ้าชอบเป็น... ',
            'choice1' => 'ก.คนที่ตื่นเช้า',
            'choice2' => 'ข.คนนอนดึก',
            'answer1' => 'ก',
            'answer2' => 'ข'
        ]);
        DB::table('tb_choice')->insert([
            'question' => '23.รูปแบบการเตรียมพร้อมก่อนเข้าร่วมประชุมของข้าพเจ้า คือ',
            'choice1' => 'ก.อยากเข้าประชุมและได้แสดงความคิดเห็นต่อที่ประชุม',
            'choice2' => 'ข.เตรียมตัวเต็มที่ และขีดเขียนวาระหัวข้อการปรชุมนั้นออกมา',
            'answer1' => 'ก',
            'answer2' => 'ข'
        ]);
        DB::table('tb_choice')->insert([
            'question' => '24.ในที่ประชุมข้าพเจ้าชอบคนที่... ',
            'choice1' => 'ก.สามารถแสดงออกทางอารมณ์ได้ดี',
            'choice2' => 'ข.ให้ความสำคัญกับงาน',
            'answer1' => 'ก',
            'answer2' => 'ข'
        ]);
        DB::table('tb_choice')->insert([
            'question' => '25.ข้าพเจ้าชอบการทำงานกับหน่วยงานที่... ',
            'choice1' => 'ก.กระตุ้นการใช้ปัญญาในการทำงานให้กับข้าพเจ้า',
            'choice2' => 'ข.ข้าพเจ้าผูกกับเป้าหมายและพันธกิจ',
            'answer1' => 'ก',
            'answer2' => 'ข'
        ]);
        DB::table('tb_choice')->insert([
            'question' => '26.ช่วงสุดสัปดาห์ ข้าพเจ้ามักจะ... ',
            'choice1' => 'ก.วางแผนล่วงหน้าว่าจะทำอะไรบ้าง',
            'choice2' => 'ข.ไปดูว่ามีอะไรเกิดขึ้นบ้าง แล้วจึงตัดสินใจเข้าร่วมตามนั้น',
            'answer1' => 'ก',
            'answer2' => 'ข'
        ]);
        DB::table('tb_choice')->insert([
            'question' => '27.ข้าพเจ้าเป็นคนประเภท ',
            'choice1' => 'ก.ชอบออกไปพบปะผู้คน',
            'choice2' => 'ข.ชอบใช้ความคิดไตร่ตรอง',
            'answer1' => 'ก',
            'answer2' => 'ข'
        ]);
        DB::table('tb_choice')->insert([
            'question' => '28.ข้าพเจ้าชอบทำงานกับหัวหน้าที่... ',
            'choice1' => 'ก.เต็มไปด้วยความคิดใหม่ๆ',
            'choice2' => 'ข.นักปฏิบัติที่ดี',
            'answer1' => 'ก',
            'answer2' => 'ข'
        ]);
        DB::table('tb_choice')->insert([
            'question' => '29.ตั้งเต่ข้อ 29-32 แต่ละข้อมี 2 ข้อความ ให้เลือกเพียงอย่างเดียว ',
            'choice1' => 'ก.สังคม(Social)',
            'choice2' => 'ข.เป็นทฤษฎี(Theoretical)',
            'answer1' => 'ก',
            'answer2' => 'ข'
        ]);
        DB::table('tb_choice')->insert([
            'question' => '30.',
            'choice1' => 'ก.ความเป็นเจ้าความคิด(Ingenuity)',
            'choice2' => 'ข.ความเป็นนักปฏิบัติ(Practicality)',
            'answer1' => 'ก',
            'answer2' => 'ข'
        ]);
        DB::table('tb_choice')->insert([
            'question' => '31. ',
            'choice1' => 'ก.การจัดรูปแบบ(Organized)',
            'choice2' => 'ข.การยืดหยุ่นได้(Adaptable)',
            'answer1' => 'ก',
            'answer2' => 'ข'
        ]);

        DB::table('tb_choice')->insert([
            'question' => '32. ',
            'choice1' => 'ก.คล่องแคล่ว(Active)',
            'choice2' => 'ข.การมีสมาธิ(Concentration)',
            'answer1' => 'ก',
            'answer2' => 'ข'
        ]);


    }
}
