@extends('layouts.test')
@section('title','| การทดสอบบุคลิกภาพ')
@section('content')

<style>
table{
            border-collapse: collapse;
            width: 100%;
            font-size: 16px;
        }
        body {
           
            font-size: 16px;
        }
</style>

<?php   $i=0;  $e=0;  $s=0;  $n=0; $t=0;  $f=0;  $j=0;  $p=0; $a=1; $x=0; $r=1; ?>
        @foreach($_POST as $choice => $answer)
        @if($choice != '_token'&& $choice != 'name'  && $choice != 'lastname'  && $choice != 'ID')
             @if(($choice == 'question2' && $answer == 'ก' ) || ($choice == 'question6' && $answer == 'ก')
             || ($choice == 'question11' && $answer == 'ก' )|| ($choice == 'question15' && $answer == 'ข') 
             || ($choice == 'question19' && $answer == 'ข') || ($choice == 'question22' && $answer == 'ก') 
             || ($choice == 'question27' && $answer == 'ข') || ($choice == 'question32' && $answer == 'ข'))
             <?php    $i++ ;?>
              @endif 
              @if(($choice == 'question2' && $answer == 'ข' )|| ($choice == 'question6' && $answer == 'ข')
              || ($choice == 'question11' && $answer == 'ข' )|| ($choice == 'question15' && $answer == 'ก') 
              || ($choice == 'question19' && $answer == 'ก') || ($choice == 'question22' && $answer == 'ข') 
              || ($choice == 'question27' && $answer == 'ก') || ($choice == 'question32' && $answer == 'ก'))
              <?php    $e++; ?>
               @endif 

               @if(($choice == 'question1' && $answer == 'ข' )|| ($choice == 'question10' && $answer == 'ข')
               || ($choice == 'question13' && $answer == 'ก' )|| ($choice == 'question16' && $answer == 'ก') 
               || ($choice == 'question17' && $answer == 'ก') || ($choice == 'question21' && $answer == 'ก') 
               || ($choice == 'question28' && $answer == 'ข') || ($choice == 'question30' && $answer == 'ข'))
               <?php    $s++ ;?>
                @endif 
                @if(($choice == 'question1' && $answer == 'ก' )|| ($choice == 'question10' && $answer =='ก')
                || ($choice == 'question13' && $answer == 'ข' )|| ($choice == 'question16' && $answer == 'ข') 
                || ($choice == 'question17' && $answer == 'ข') || ($choice == 'question21' && $answer == 'ข') 
                || ($choice == 'question28' && $answer == 'ก') || ($choice == 'question30' && $answer == 'ก'))
                <?php    $n++; ?>
                 @endif 

                 @if(($choice == 'question3' && $answer == 'ก' )|| ($choice == 'question5' && $answer =='ก')
                 || ($choice == 'question12' && $answer == 'ก' )|| ($choice == 'question14' && $answer == 'ข') 
                 || ($choice == 'question20' && $answer == 'ก') || ($choice == 'question24' && $answer == 'ข') 
                 || ($choice == 'question25' && $answer == 'ก') || ($choice == 'question29' && $answer == 'ข'))
                 <?php    $t++; ?>
                  @endif
                  @if(($choice == 'question3' && $answer == 'ข' ) || ($choice == 'question5' && $answer =='ข')
                  || ($choice == 'question12' && $answer == 'ข' )|| ($choice == 'question14' && $answer == 'ก') 
                  || ($choice == 'question20' && $answer == 'ข') || ($choice == 'question24' && $answer == 'ก') 
                  || ($choice == 'question25' && $answer == 'ข') || ($choice == 'question29' && $answer == 'ก'))
                  <?php    $f++; ?>
                   @endif  
              

                   @if(($choice == 'question4' && $answer == 'ก' )|| ($choice == 'question7' && $answer =='ก')
                   || ($choice == 'question8' && $answer == 'ข' )|| ($choice == 'question9' && $answer == 'ก') 
                   || ($choice == 'question18' && $answer == 'ข') || ($choice == 'question23' && $answer == 'ข') 
                   || ($choice == 'question26' && $answer == 'ก') || ($choice == 'question31' && $answer == 'ก'))
                   <?php    $j++; ?>
                    @endif
                    @if(($choice == 'question4' && $answer == 'ข' )|| ($choice =='question7' && $answer =='ข')
                    || ($choice == 'question8' && $answer == 'ก' )|| ($choice == 'question9' && $answer == 'ข') 
                    || ($choice == 'question18' && $answer == 'ก') || ($choice == 'question23' && $answer == 'ก') 
                    || ($choice == 'question26' && $answer == 'ข') || ($choice == 'question31' && $answer == 'ข'))
                    <?php    $p++; ?>
                     @endif  


           @endif
         @endforeach

         @if($i == $e && $i !=0 && $e != 0)
         @foreach($_POST as $choice => $answer)
         @if($choice == 'question11' && $answer == 'ข' )
         <?php    $e--; ?>
         @elseif($choice == 'question11' && $answer == 'ก' )
         <?php    $i--; ?>
         @endif
         @endforeach
         @endif


         @if($s == $n && $s !=0 && $n != 0)
         @foreach($_POST as $choice => $answer)
         @if($choice == 'question16' && $answer == 'ข' )
         <?php    $s--; ?>
         @elseif($choice == 'question16' && $answer == 'ก' )
         <?php    $n--; ?>
         @endif
         @endforeach
         @endif

         @if($t == $f && $t !=0 && $f != 0)
         @foreach($_POST as $choice => $answer)
         @if($choice == 'question24' && $answer == 'ข' )
         <?php    $t--; ?>
         @elseif($choice == 'question24' && $answer == 'ก' )
         <?php    $f--; ?>
         @endif
         @endforeach
         @endif

         @if($j == $p && $j !=0 && $p != 0)
         @foreach($_POST as $choice => $answer)
         @if($choice == 'question23' && $answer == 'ข' )
         <?php    $j--; ?>
         @elseif($choice == 'question23' && $answer == 'ก' )
         <?php    $p--; ?>
         @endif
         @endforeach
         @endif
         

         <div class="container">
        
                    <div class="panel panel-success" style="width:100%">
                        <div class="panel-heading">สรุปผลการให้คะแนน: นับ 1 คะแนน สำหรับแต่ละคำตอบของท่านในแบบเฉลยต่อไปนี้</div>
                        <div class="panel-body">
                            {{Form::open(['url'=>'mbti',])}}
                            <div class ="form-group">
                                <div class="row"> 
                                    <div class="col-md-2">
                                        <div class="form-group">  
                                @isset($_POST['ID'])
                            
                                        <input type="text" name="ID" value="{{$_POST['ID']}}" hidden/>
                                <input type="text"  hidden/>
                                @endisset
                                         </div>
                                    </div>
                                    <div class="col-md-3">
                                        <div class="form-group"> 
                                @isset($_POST['name'])
                                <label> ชื่อ:: {{$name= $_POST['name']}}</label> 
                                <input type="text" name="name" value="{{$_POST['name']}}" hidden/>
                          
                                @endisset

                                @isset($_POST['lastname'])
                                <label> {{$lastname= $_POST['lastname']}} ::ผู้ทดสอบ::</label> 
                                <input type="text" name="lastname" value="{{$lastname= $_POST['lastname']}}" hidden/>
                               
                                @endisset
                              </div>
                            </div>
                           
                              </div>
                            </div>
                              <h3>คำตอบที่คุณเลือก:</h3>
                              <ul class="list-group">
                                  <li class="list-group-item">
                            
                                      <table class="table table-striped">
                                          <thead>
                                            <tr>
                                              <th style="text-align:center">M</th>
                                              <th style="text-align:center">B</th>
                                              <th style="text-align:center">T</th>
                                              <th style="text-align:center">I</th>
                                            </tr>
                                          </thead>
                                          <tbody>
                                          <?php  $col=4; $u=0;?>   
                                          @foreach($_POST as $choice => $answer)
                                          @if($choice != '_token'&& $choice != 'name'  && $choice != 'lastname'  && $choice != 'ID')
                                                   @if($u==0) 
                                                        <?php echo "<tr align=center>"; ?>
                                                     @endif
                                               <?php $u++; ?>
                                                           @if($u <=  $col) 
                                                           <input type="hidden" name="{{$choice}}"  value="{{$answer}}" >
                                                                   <td>ข้อ{{$r++}}:: ตอบ {{$answer}}   </td>   
                                                          @endif
                                                                 @if($u==$col)
                                                                        <?php $u=0; ?>
                                                        <?php echo "</tr>"; ?>
                                                  @endif
                                             @endif
                                           @endforeach
                                             
                                          </tbody>
                                        
                                        </table>
                            </li>
                            </ul>
                      
                        <div class ="form-group">
                             <table class="table table-bordered">
                                <thead>
                                  <tr>
                                      <th>คะแนนสำหรับ "I"</th>
                                      <th>คะแนนสำหรับ "E"</th>
                                      <th>คะแนนสำหรับ "S"</th>
                                      <th>คะแนนสำหรับ "N"</th>
                                  </tr>
                                </thead>
                                <tbody>
                                  <tr>
                                      <td align= "center">2 ก<br>6 ก<br>11 ก<br>15 ข<br>19 ข<br>22 ก<br>27 ข<br>32 ข</td>
                                      <td align= "center">2 ข<br>6 ข<br>11 ข<br>15 ก<br>19 ก<br>22 ข<br>27 ก<br>32 ก</td>
                                      <td align= "center">1 ข<br>10 ข<br>13 ก<br>16 ก<br>17 ก<br>21 ก<br>28 ข<br>30 ข</td>
                                      <td align= "center">1 ก<br>10 ก<br>13 ข<br>16 ข<br>17 ข<br>21 ข<br>28 ก<br>30 ก</td>
                                  </tr>
                                  <tr>
                                    <td align= "center">คุณได้คะแนน {{$i}} <input type="text" name="scoreI" value="{{$i}}" hidden/> คะแนน</td>
                                    <td align= "center">คุณได้คะแนน {{$e}} <input type="text" name="scoreE" value="{{$e}}" hidden/> คะแนน</td>
                                    <td align= "center">คุณได้คะแนน {{$s}} <input type="text" name="scoreS" value="{{$s}}" hidden/> คะแนน</td>
                                    <td align= "center">คุณได้คะแนน {{$n}} <input type="text" name="scoreN" value="{{$n}}" hidden/> คะแนน</td>
                                  </tr>
                                </tbody>
                              </table>
                            </div>
                            <div class ="form-group">
                              @if($i>$e)
          
                                    <h4>ท่านได้คะแนน "I" กับ "E" อย่างไหนมากกว่ากันตอบ &emsp; "I" </h4>
                                    <input type="text" name="answerIE" value="I" hidden/>
                              @else
                              
                                    <h4>ท่านได้คะแนน "I" กับ "E" อย่างไหนมากกว่ากันตอบ &emsp; "E" </h4>
                                    <input type="text" name="answerIE" value="E" hidden/>
                              
                              @endif 
                                    &emsp;&emsp;<code>หมายเหตุ:ถ้าได้คะแนน "I" เท่ากับ "E" จะไม่นับคะแนนข้อ 11</code><br>
          
                              @if($s>$n)
          
                                      <h4>ท่านได้คะแนน "S" กับ "N" อย่างไหนมากกว่ากันตอบ &emsp; "S" </h4>
                                      <input type="text" name="answerSN" value="S" hidden/>
                              @else
                                     <h4>ท่านได้คะแนน "S" กับ "N" อย่างไหนมากกว่ากันตอบ &emsp; "N" </h4>
                                     <input type="text" name="answerSN" value="N" hidden/>
                              @endif 
                                
                                    &emsp;&emsp;<code>หมายเหตุ:ถ้าได้คะแนน "S" เท่ากับ "N" จะไม่นับคะแนนข้อ 16</code>
          
                              </div>
                            <div class ="form-group">
                              <table class="table table-bordered">
                                  <thead >
                                    <tr>
                                        <th>คะแนนสำหรับ "T"</th>
                                        <th>คะแนนสำหรับ "F"</th>
                                        <th>คะแนนสำหรับ "J"</th>
                                        <th>คะแนนสำหรับ "P"</th>
                                      
                                    </tr>
                                  </thead>
                                  <tbody>
                                    <tr>
                                    <td align= "center">3 ก<br>5 ก<br>12 ก<br>14 ข<br>20 ก<br>24 ข<br>25 ก<br>29 ข</td>
                                    <td align= "center">3 ข<br>5 ข<br>12 ข<br>14 ก<br>20 ข<br>24 ก<br>25 ข<br>29 ก</td>
                                    <td align= "center">4 ก<br>7 ก<br>8 ข<br>9 ก<br>18 ข<br>23 ข<br>26 ก<br>31 ก</td>
                                    <td align= "center">4 ข<br>7 ข<br>8 ก<br>9 ข<br>18 ก<br>23 ก<br>26 ข<br>31 ข</td>
                                      
                                    </tr>
                                    <tr>
                                      <td align= "center">คุณได้คะแนน {{$t}} <input type="text" name="scoreT" value="{{$t}}" hidden/> คะแนน</td>
                                      <td align= "center">คุณได้คะแนน {{$f}} <input type="text" name="scoreF" value="{{$f}}" hidden/>คะแนน</td>
                                      <td align= "center">คุณได้คะแนน {{$j}} <input type="text" name="scoreJ" value="{{$j}}" hidden/>คะแนน</td>
                                      <td align= "center">คุณได้คะแนน {{$p}} <input type="text" name="scoreP" value="{{$p}}" hidden/>คะแนน</td>
                                    </tr>
                                  </tbody>
                                </table>
                              </div>
                              <div class ="form-group">
                                  @if($t>$f)
                                    <h4>ท่านได้คะแนน "T" กับ "F" อย่างไหนมากกว่ากันตอบ &emsp; "T" </h4>
                                    <input type="text" name="answerTF" value="T" hidden/>
                                  @else  
                                    <h4>ท่านได้คะแนน "T" กับ "F" อย่างไหนมากกว่ากันตอบ &emsp; "F" </h4>
                                    <input type="text" name="answerTF" value="F" hidden/>
                                  @endif 
                                  &emsp;&emsp;
                                  <code>   หมายเหตุ:ถ้าได้คะแนน "T" เท่ากับ "F" จะไม่นับคะแนนข้อ 11</code>
                                  @if($j>$p)
                                  <h4>ท่านได้คะแนน "J" กับ "P" อย่างไหนมากกว่ากันตอบ &emsp; "J" </h4>
                                  <input type="text" name="answerJP" value="J" hidden/>
                                  @else
                                  <h4>ท่านได้คะแนน "J" กับ "P" อย่างไหนมากกว่ากันตอบ &emsp; "P" </h4>
                                  <input type="text" name="answerJP" value="P" hidden/>
                                  @endif 
                                     &emsp;&emsp;
                                     <code> หมายเหตุ:ถ้าได้คะแนน "J" เท่ากับ "P" จะไม่นับคะแนนข้อ 16</code>
                                  </div>
                                  <div class ="form-group">
                                    <ul class="list-group">
          
                                    
          <!--  1 ************************************************************************************************************************************1  -->
           
                                     @if(($i>$e) && ($s>$n) && ($t>$f) && ($j>$p))
          
                                     <input type="text" name="conclude" value="ISTJ" hidden/>
                                     <li class="list-group-item">ท่านได้คะแนนคือ <label>ISTJ</label>คุณลักษณะบุคลิกภาพ
                                      <br>- จริงจัง สงบนิ่ง ใช้สมาธิและการไตร่ตรองเพื่อ
                                      หาคำตอบ เน้นการทำได้จริงยึดข้อเท็จจริงและ
                                      การจัดลำดับ ใช้หลักของเหตุผลความจริงและ
                                      สามารถพึ่งพาได้ มองว่าทุกสิ่งทุกอย่างลงตัวดีอยู่
                                      แล้ว มีความรับผิดชอบ ตัดสินใจด้วยตนเองว่า
                                      ควรทำอะไรแล้วทำอย่างมุ่งมั่นโดยไม่หวั่นไหว
                                      แม้มีคนไม่เห็นด้วยหรือท้วงติงก็ตาม
                                      - มีความสุขที่ได้จัดระเบียบชีวิต งาน และ
                                      ครอบครัว
                                      - ยึดค่านิยมเรื่องขนบธรรมเนียมประเพณีและ
                                      ความภักดี 
                                      <input type="hidden" name="meaning" value="- จริงจัง สงบนิ่ง ใช้สมาธิและการไตร่ตรองเพื่อ
                                      หาคำตอบ เน้นการทำได้จริงยึดข้อเท็จจริงและ
                                      การจัดลำดับ ใช้หลักของเหตุผลความจริงและ
                                      สามารถพึ่งพาได้ มองว่าทุกสิ่งทุกอย่างลงตัวดีอยู่
                                      แล้ว มีความรับผิดชอบ ตัดสินใจด้วยตนเองว่า
                                      ควรทำอะไรแล้วทำอย่างมุ่งมั่นโดยไม่หวั่นไหว
                                      แม้มีคนไม่เห็นด้วยหรือท้วงติงก็ตาม
                                      - มีความสุขที่ได้จัดระเบียบชีวิต งาน และ
                                      ครอบครัว
                                      - ยึดค่านิยมเรื่องขนบธรรมเนียมประเพณีและ
                                      ความภักดี  " />
                                    
                                    
                                    </li>
          
          
                                     @elseif(($i>$e) && ($s>$n) && ($t<$f) && ($j>$p))
          
                                     <input type="text" name="conclude" value="ISFJ" hidden/>
          
                                     <li class="list-group-item">ท่านได้คะแนนคือ <label>ISFJ</label>คุณลักษณะบุคลิกภาพ
                                      <br>- สงบนิ่ง เป็นมิตร มีความรับผิดชอบ และ
                                      ทำงานที่ได้รับมอบหมายด้วยความทุ่มเท
                                      ชอบรับใช้เพื่อนและส่วนรวม มีความ
                                      ใคร่ครวญ มานะ บากบั่น เที่ยงตรง อาจ
                                      ต้องใช้เวลามากถ้าจะเรียนรู้เครื่องจักรกล
                                      ทั้งนี้เพราะไม่ชอบและสนใจด้านเทคนิค
                                      นัก มีความอดทนต่อรายละเอียดและงาน
                                      ประจำมีความภักดี เห็นอกเห็นใจ และเอื้อ
                                      อาทรต่อความรู้สึกของผู้อื่น
                                      - มุ่งมั่นในการสร้างความเป็นระเบียบ
                                      เรียบร้อยของบรรยากาศที่ทำงานและที่บ้าน 
                                    
                                      <input type="hidden" name="meaning" value="- สงบนิ่ง เป็นมิตร มีความรับผิดชอบ และ
                                      ทำงานที่ได้รับมอบหมายด้วยความทุ่มเท
                                      ชอบรับใช้เพื่อนและส่วนรวม มีความ
                                      ใคร่ครวญ มานะ บากบั่น เที่ยงตรง อาจ
                                      ต้องใช้เวลามากถ้าจะเรียนรู้เครื่องจักรกล
                                      ทั้งนี้เพราะไม่ชอบและสนใจด้านเทคนิค
                                      นัก มีความอดทนต่อรายละเอียดและงาน
                                      ประจำมีความภักดี เห็นอกเห็นใจ และเอื้อ
                                      อาทรต่อความรู้สึกของผู้อื่น
                                      - มุ่งมั่นในการสร้างความเป็นระเบียบ
                                      เรียบร้อยของบรรยากาศที่ทำงานและที่บ้าน "/>
                                    
                                    </li>
          
                                     @elseif(($i>$e) && ($s>$n) && ($t>$f) && ($j<$p))
          
                                     <input type="text" name="conclude" value="ISTP" hidden/>
          
                                     <li class="list-group-item">ท่านได้คะแนนคือ <label>ISTP</label>คุณลักษณะบุคลิกภาพ
                                      <br>- มองคนอื่นอย่างเย็นชา สงบนิ่ง ไว้ตัว ชอบ
                                      สังเกตและวิเคราะห์ชีวิตอย่างกระตือรือร้น โดย
                                      อาจระบายเชิงขำขันออกมาอย่างไม่คาดหมาย
                                      ปกติจะสนใจต่อหลักการเหตุและผลที่ไม่เป็น
                                      ส่วนตัวหรือคำถาม เช่น เครื่องจักรทำงานได้
                                      อย่างไร เพราะเหตุใด เป็นต้น แต่จะไม่ยอม
                                      เสียเวลาคิดมากนักเพราะคือว่า เสียพลังงานไป
                                      โดยเปล่าประโยชน์
                                      - สนใจต่อเหตุที่นำไปสู่ผล ใช้หลักการทาง
                                      ตรรกะในการจัดระบบข้อมูล
                                      - ยึดค่านิยมเรื่องความมีประสิทธิภาพ 
                                    
                                      <input type="hidden" name="meaning" value="- มองคนอื่นอย่างเย็นชา สงบนิ่ง ไว้ตัว ชอบ
                                      สังเกตและวิเคราะห์ชีวิตอย่างกระตือรือร้น โดย
                                      อาจระบายเชิงขำขันออกมาอย่างไม่คาดหมาย
                                      ปกติจะสนใจต่อหลักการเหตุและผลที่ไม่เป็น
                                      ส่วนตัวหรือคำถาม เช่น เครื่องจักรทำงานได้
                                      อย่างไร เพราะเหตุใด เป็นต้น แต่จะไม่ยอม
                                      เสียเวลาคิดมากนักเพราะคือว่า เสียพลังงานไป
                                      โดยเปล่าประโยชน์
                                      - สนใจต่อเหตุที่นำไปสู่ผล ใช้หลักการทาง
                                      ตรรกะในการจัดระบบข้อมูล
                                      - ยึดค่านิยมเรื่องความมีประสิทธิภาพ  " />
                                    
                                    </li>
          
                                      @elseif(($i>$e) && ($s>$n) && ($t<$f) && ($j<$p))
          
                                      <input type="text" name="conclude" value="ISFP" hidden/>
          
                                      <li class="list-group-item">ท่านได้คะแนนคือ <label>ISFP</label>คุณลักษณะบุคลิกภาพ
                                        <br>- เหนียมอาย มีความเป็นมิตรอยู่เงียบ ๆ
                                        อ่อนไหวง่าย ถ่อมตัวเกี่ยวกับความสามารถ
                                        ของตน มักหลีกเลี่ยงความขัดแย้ง ไม่ชอบ
                                        บีบบังคับให้คนอื่นเห็นด้วยหรือเชื่อเหมือน
                                        ตน ปกติไม่สนใจที่จะเป็นผู้นำใคร แต่จะ
                                        ผูกพันต่อลูกน้อง ไม่เร่งรัดหรือเคร่งเครียด
                                        เมื่อต้องทำงานให้เสร็จตามที่ได้รับ
                                        มอบหมายด้วยเหตุผลคือ ไม่อยากทำลาย
                                        บรรยากาศดีๆ ในขณะนั้น เพราะงานเร่งรีบ
                                        มากดดันหรือต้องออกแรงมากกว่าปกติ
                                        - ไม่ชอบความขัดแย้งหรือแตกแยก ไม่
                                        ชอบใช้ความเห็นหรือค่านิยมของตนไปบีบ
                                        บังคับผู้อื่น
          
                                        <input type="hidden" name="meaning" value="- เหนียมอาย มีความเป็นมิตรอยู่เงียบ ๆ
                                        อ่อนไหวง่าย ถ่อมตัวเกี่ยวกับความสามารถ
                                        ของตน มักหลีกเลี่ยงความขัดแย้ง ไม่ชอบ
                                        บีบบังคับให้คนอื่นเห็นด้วยหรือเชื่อเหมือน
                                        ตน ปกติไม่สนใจที่จะเป็นผู้นำใคร แต่จะ
                                        ผูกพันต่อลูกน้อง ไม่เร่งรัดหรือเคร่งเครียด
                                        เมื่อต้องทำงานให้เสร็จตามที่ได้รับ
                                        มอบหมายด้วยเหตุผลคือ ไม่อยากทำลาย
                                        บรรยากาศดีๆ ในขณะนั้น เพราะงานเร่งรีบ
                                        มากดดันหรือต้องออกแรงมากกว่าปกติ
                                        - ไม่ชอบความขัดแย้งหรือแตกแยก ไม่
                                        ชอบใช้ความเห็นหรือค่านิยมของตนไปบีบ
                                        บังคับผู้อื่น" />
                                      
                                      </li>
                                         
          <!--  2 ************************************************************************************************************************************2  -->
          
                                     @elseif(($i<$e) && ($s>$n) && ($t>$f) && ($j<$p))
          
                                     <input type="text" name="conclude" value="ESTP" hidden/>
          
                                     <li class="list-group-item">ท่านได้คะแนนคือ <label>ESTP</label>คุณลักษณะบุคลิกภาพ
                                      <br>- ยึดข้อเท็จจริง ไม่ค่อยวิตกกังวลหรือรีบร้อน
                                      พอใจไม่ว่าอะไรจะเกิดขึ้น มักชอบกีฬาหรือ
                                      วัตถุที่เกี่ยวกับจักรกล ชอบมีเพื่อน มักแข็งทื่อ
                                      หรือขาดความไวด้านการรับรู้ ความรู้สึก มี
                                      ความสามารถด้านคณิตศาสตร์และ
                                      วิทยาศาสตร์ ไม่ชอบคำอธิบายที่ยืดยาว มี
                                      ความถนัดในอาชีพที่ต้องใช้เครื่องจักรกล โดย
                                      รู้ถึงกลไกการทำงาน การถอดชิ้นส่วนออก
                                      หรือประกอบกลับคืนอย่างเดิม
                                      - ชอบเสพสุขและมีชีวิตโดยยึดวัตถุ รักการ
                                      เรียนรู้โดยการกระทำ
                                      
                                      <input type="hidden" name="meaning" value="- ยึดข้อเท็จจริง ไม่ค่อยวิตกกังวลหรือรีบร้อน
                                      พอใจไม่ว่าอะไรจะเกิดขึ้น มักชอบกีฬาหรือ
                                      วัตถุที่เกี่ยวกับจักรกล ชอบมีเพื่อน มักแข็งทื่อ
                                      หรือขาดความไวด้านการรับรู้ ความรู้สึก มี
                                      ความสามารถด้านคณิตศาสตร์และ
                                      วิทยาศาสตร์ ไม่ชอบคำอธิบายที่ยืดยาว มี
                                      ความถนัดในอาชีพที่ต้องใช้เครื่องจักรกล โดย
                                      รู้ถึงกลไกการทำงาน การถอดชิ้นส่วนออก
                                      หรือประกอบกลับคืนอย่างเดิม
                                      - ชอบเสพสุขและมีชีวิตโดยยึดวัตถุ รักการ
                                      เรียนรู้โดยการกระทำ" />
                                    
                                    </li>
          
                                     @elseif(($i<$e) && ($s>$n) && ($t<$f) && ($j<$p))
          
                                     <input type="text" name="conclude" value="ESFP" hidden/>
                                     <li class="list-group-item">ท่านได้คะแนนคือ <label>ESFP</label>คุณลักษณะบุคลิกภาพ
                                      <br>- ชอบสังคม เข้าคนได้ง่าย ชอบการยอมรับ
                                      มิตรภาพและบรรยากาศสนุกสนาน เมื่อรู้ว่า
                                      กิจกรรมใดจะเกิดขึ้น ก็กระหายที่จะเข้าร่วม
                                      สามารถจำข้อเท็จจริงได้ดีกว่าเข้าใจทฤษฎี
                                      เหมาะที่จะทำงานในสถานการณ์ไม่ยุ่งยาก
                                      ซับซ้อน มีทักษะการทำงานเกี่ยวกับคนได้ดี
                                      พอๆ กับวัตถุสิ่งของ
                                      - เรียนรู้ได้ดีด้วยการเข้าร่วมฝึกหัดทักษะใหม่
                                      ร่วมกับผู้อื่น
                                      <input type="hidden" name="meaning" value="- ชอบสังคม เข้าคนได้ง่าย ชอบการยอมรับ
                                      มิตรภาพและบรรยากาศสนุกสนาน เมื่อรู้ว่า
                                      กิจกรรมใดจะเกิดขึ้น ก็กระหายที่จะเข้าร่วม
                                      สามารถจำข้อเท็จจริงได้ดีกว่าเข้าใจทฤษฎี
                                      เหมาะที่จะทำงานในสถานการณ์ไม่ยุ่งยาก
                                      ซับซ้อน มีทักษะการทำงานเกี่ยวกับคนได้ดี
                                      พอๆ กับวัตถุสิ่งของ
                                      - เรียนรู้ได้ดีด้วยการเข้าร่วมฝึกหัดทักษะใหม่
                                      ร่วมกับผู้อื่น" />
                                    
                                    </li>
          
                                     @elseif(($i<$e) && ($s>$n) && ($t>$f) && ($j>$p))
          
                                     <input type="text" name="conclude" value="ESTJ" hidden/>
                                     <li class="list-group-item">ท่านได้คะแนนคือ <label>ESTJ</label>คุณลักษณะบุคลิกภาพ
                                      <br>- ชอบการปฏิบัติได้จริง เน้นข้อเท็จจริงมี
                                      ความถนัดทั้งด้านธุรกิจและจักรกลต่างๆ ไม่
                                      สนใจวิชาที่ตนเห็นว่าไม่ได้ประโยชน์ แต่ก็
                                      สามารถประยุกต์ใช้ได้เมื่อถึงคราวจำเป็น
                                      ชอบร่วมและเป็นนักจัดกิจกรรม มักทำอะไร
                                      ได้ดี โดยเฉพาะงานที่ต้องระมัดระวังการ
                                      กระทบความรู้สึกหรือความคิดเห็นของผู้อื่น
                                      - ใช้พลังผลักดันให้แผนของตนสามารถลงสู่
                                      การปฏิบัติ
                                      <input type="hidden" name="meaning" value="- ชอบการปฏิบัติได้จริง เน้นข้อเท็จจริงมี
                                      ความถนัดทั้งด้านธุรกิจและจักรกลต่างๆ ไม่
                                      สนใจวิชาที่ตนเห็นว่าไม่ได้ประโยชน์ แต่ก็
                                      สามารถประยุกต์ใช้ได้เมื่อถึงคราวจำเป็น
                                      ชอบร่วมและเป็นนักจัดกิจกรรม มักทำอะไร
                                      ได้ดี โดยเฉพาะงานที่ต้องระมัดระวังการ
                                      กระทบความรู้สึกหรือความคิดเห็นของผู้อื่น
                                      - ใช้พลังผลักดันให้แผนของตนสามารถลงสู่
                                      การปฏิบัติ" />
                                    </li>
          
                                     @elseif(($i<$e) && ($s>$n) && ($t<$f) && ($j>$p))
          
                                     <input type="text" name="conclude" value="ESFJ" hidden/>
                                     <li class="list-group-item">ท่านได้คะแนนคือ <label>ESFJ</label>คุณลักษณะบุคลิกภาพ
                                      <br>- มีไมตรีจิต ช่างคุย กว้างขวาง รอบคอบ ชอบ
                                      การร่วมมือ เป็นสมาชิกที่กระตือรือร้นของทีม
                                      ชอบทำสิ่งดีๆ ให้ผู้อื่นเสมอ มักทำงานได้ดี
                                      เมื่อได้รับกำลังใจหรือคำชม ให้ความสนใจ
                                      น้อยกับสิ่งที่เป็นนามธรรม หรือสิ่งที่เกี่ยวกับ
                                      ด้านเทคนิค แต่จะมีความสนใจหลักต่อสิ่งที่
                                      สามารถมองเห็นได้ และมีผลกระทบโดยตรง
                                      ต่อการดำรงชีวิตของคนอื่น
                                      - ต้องการได้รับการยกย่องในความสำคัญของ
                                      ตนและงานที่ตนทำ
                                      <input type="hidden" name="meaning" value="- มีไมตรีจิต ช่างคุย กว้างขวาง รอบคอบ ชอบ
                                      การร่วมมือ เป็นสมาชิกที่กระตือรือร้นของทีม
                                      ชอบทำสิ่งดีๆ ให้ผู้อื่นเสมอ มักทำงานได้ดี
                                      เมื่อได้รับกำลังใจหรือคำชม ให้ความสนใจ
                                      น้อยกับสิ่งที่เป็นนามธรรม หรือสิ่งที่เกี่ยวกับ
                                      ด้านเทคนิค แต่จะมีความสนใจหลักต่อสิ่งที่
                                      สามารถมองเห็นได้ และมีผลกระทบโดยตรง
                                      ต่อการดำรงชีวิตของคนอื่น
                                      - ต้องการได้รับการยกย่องในความสำคัญของ
                                      ตนและงานที่ตนทำ" />
                                    </li>
          
           <!--  3************************************************************************************************************************************3  -->
          
                                     @elseif(($i>$e) && ($s<$n) && ($t<$f) && ($j>$p))
          
                                     <input type="text" name="conclude" value="INFJ" hidden/>
                                     <li class="list-group-item">ท่านได้คะแนนคือ <label>INFJ</label>คุณลักษณะบุคลิกภาพ
                                      <br>- มักประสบความสำเร็จด้วยความพากเพียร
                                      การริเริ่มใหม่ๆ และความต้องการอะไรก็
                                      ตามที่ใจปรารถนา จะใช้ความพยายามอย่างดี
                                      ที่สุดต่อการทำงาน ใช้การผลักดันอยู่เบื้อหลัง
                                      เงียบๆ ด้วยความรอบคอบ แต่ห่วงใยต่อผู้อื่น
                                      เป็นผู้ที่เคารพต่อหลักการของบริษัท ชอบการ
                                      ให้เกียรติและการยอมรับในการแก้ไข
                                      ข้อผิดพลาด เพื่อให้เกิดประโยชน์ต่อส่วนรวม
                                      - เก่งในการจัดงาน และเฉียบแหลมในการนำ
                                      วิสัยทัศน์ของตนลงสู่การปฏิบัติ
                                      <input type="hidden" name="meaning" value="- มักประสบความสำเร็จด้วยความพากเพียร
                                      การริเริ่มใหม่ๆ และความต้องการอะไรก็
                                      ตามที่ใจปรารถนา จะใช้ความพยายามอย่างดี
                                      ที่สุดต่อการทำงาน ใช้การผลักดันอยู่เบื้อหลัง
                                      เงียบๆ ด้วยความรอบคอบ แต่ห่วงใยต่อผู้อื่น
                                      เป็นผู้ที่เคารพต่อหลักการของบริษัท ชอบการ
                                      ให้เกียรติและการยอมรับในการแก้ไข
                                      ข้อผิดพลาด เพื่อให้เกิดประโยชน์ต่อส่วนรวม
                                      - เก่งในการจัดงาน และเฉียบแหลมในการนำ
                                      วิสัยทัศน์ของตนลงสู่การปฏิบัติ"/>
                                    </li>
          
                                     @elseif(($i>$e) && ($s<$n) && ($t>$f) && ($j>$p))
          
                                     <input type="text" name="conclude" value="INTJ" hidden/>
                                     <li class="list-group-item">ท่านได้คะแนนคือ <label>INTJ</label>คุณลักษณะบุคลิกภาพ
                                      <br>- มีพื้นฐานของจิตใจและแรงจูงใจไปใน
                                      ทิศทางเพื่อตอบสนองเป้าหมายของตนเอง
                                      โดยเฉพาะถ้าทำในสิ่งที่ต้องการแล้วก็จะทุ่มเท
                                      พลังของตนเองอย่างเต็มที่ แม้ปราศจากความ
                                      ช่วยเหลือจากคนอื่นก็ตาม เป็นคนขี้สงสัย
                                      ชอบวิจารณ์ ชอบอิสระ และมีความมุ่งมั่น แต่
                                      ชอบแสดงความดื้อรั้นอยู่บ่อยๆ จึงควรได้
                                      ปรับปรุงให้หัดมองข้ามเรื่องประเด็นปลีกย่อย
                                      เพื่อความสำเร็จในประเด็นที่สำคัญมากกว่า
                                      - มีมาตรฐานของการปฏิบัติงานและผลงาน
                                      ของตน และผู้อื่นสูง
                                      <input type="hidden" name="meaning" value="- มีพื้นฐานของจิตใจและแรงจูงใจไปใน
                                      ทิศทางเพื่อตอบสนองเป้าหมายของตนเอง
                                      โดยเฉพาะถ้าทำในสิ่งที่ต้องการแล้วก็จะทุ่มเท
                                      พลังของตนเองอย่างเต็มที่ แม้ปราศจากความ
                                      ช่วยเหลือจากคนอื่นก็ตาม เป็นคนขี้สงสัย
                                      ชอบวิจารณ์ ชอบอิสระ และมีความมุ่งมั่น แต่
                                      ชอบแสดงความดื้อรั้นอยู่บ่อยๆ จึงควรได้
                                      ปรับปรุงให้หัดมองข้ามเรื่องประเด็นปลีกย่อย
                                      เพื่อความสำเร็จในประเด็นที่สำคัญมากกว่า
                                      - มีมาตรฐานของการปฏิบัติงานและผลงาน
                                      ของตน และผู้อื่นสูง" />
                                    </li>
          
                                     @elseif(($i>$e) && ($s<$n) && ($t<$f) && ($j<$p))
          
                                     <input type="text" name="conclude" value="INFP" hidden/>
                                     <li class="list-group-item">ท่านได้คะแนนคือ <label>INFP</label>คุณลักษณะบุคลิกภาพ
                                      <br>- เต็มไปด้วยความเลื่อมใสศรัทธา และ
                                      จงรักภักดี แต่มักปิดปากเงียบ จนกว่าจะ
                                      คุ้นเคยกันอย่างดีเแล้ว ใส่ใจต่อการเรียนรู้ ด้าน
                                      ความคิดและภาษา ชอบริเริ่มโครงการอิสระ
                                      ของตนเอง เหมาะกับงานบรรณาธิการจัดทำ
                                      หนังสือสารานุกรม มักรับงานมากเกินตัวที่จะ
                                      ทำได้หมด มีความเป็นมิตร โดยพยายาม
                                      แสดงออกถึงความสามารถทางสังคมของตน
                                      - พร้อมที่จะปรับตัว ยืดหยุ่นและให้การ
                                      ยอมรับการกระทำหรืองานใด ๆ ที่มิใช่เป็น
                                      การบีบบังคับ
                                      <input type="hidden" name="meaning" value="- เต็มไปด้วยความเลื่อมใสศรัทธา และ
                                      จงรักภักดี แต่มักปิดปากเงียบ จนกว่าจะ
                                      คุ้นเคยกันอย่างดีเแล้ว ใส่ใจต่อการเรียนรู้ ด้าน
                                      ความคิดและภาษา ชอบริเริ่มโครงการอิสระ
                                      ของตนเอง เหมาะกับงานบรรณาธิการจัดทำ
                                      หนังสือสารานุกรม มักรับงานมากเกินตัวที่จะ
                                      ทำได้หมด มีความเป็นมิตร โดยพยายาม
                                      แสดงออกถึงความสามารถทางสังคมของตน
                                      - พร้อมที่จะปรับตัว ยืดหยุ่นและให้การ
                                      ยอมรับการกระทำหรืองานใด ๆ ที่มิใช่เป็น
                                      การบีบบังคับ" >
                                    </li>
          
                                     @elseif(($i>$e) && ($s<$n) && ($t>$f) && ($j<$p))
          
                                     <input type="text" name="conclude" value="INTP" hidden/>
                                     <li class="list-group-item">ท่านได้คะแนนคือ <label>INTP </label>คุณลักษณะบุคลิกภาพ
                                       <br>- สงบนิ่ง ไว้ตัว มีความสามารถสูงในการทำ
                                        ข้อสอบเชิงทฤษฎี หรือวิชาแขนงวิทยาศาสตร์
                                        เก่งการให้เหตุผล จนสามารถแยกแยะลงไปถึง
                                        ประเด็นย่อยๆ ได้ มีความสนใจด้านความคิด
                                        สูง แต่มักแยกจากกลุ่ม สามารถอธิบายสิ่งที่
                                        ตนสนใจได้อย่างลึกซึ้ง และแหลมคม จึง
                                        เหมาะที่จะประกอบอาชีพที่ตรงกับความ
                                        สนใจ ซึ่งตัวเองเชื่อว่าเป็นประโยชน์และตน
                                        ได้ใช้ความถนัดของตนเต็มที่
                                        - ชอบสงสัย วิพากวิจารณ์ และคิดเชิง
                                        วิเคราะห์อยู่เสมอ 
                                      
                                      <input type="hidden" name="meaning" value="- สงบนิ่ง ไว้ตัว มีความสามารถสูงในการทำข้อสอบเชิงทฤษฎี หรือวิชาแขนงวิทยาศาสตร์
                                      เก่งการให้เหตุผล จนสามารถแยกแยะลงไปถึง
                                      ประเด็นย่อยๆ ได้ มีความสนใจด้านความคิด
                                      สูง แต่มักแยกจากกลุ่ม สามารถอธิบายสิ่งที่
                                      ตนสนใจได้อย่างลึกซึ้ง และแหลมคม จึง
                                      เหมาะที่จะประกอบอาชีพที่ตรงกับความ
                                      สนใจ ซึ่งตัวเองเชื่อว่าเป็นประโยชน์และตน
                                      ได้ใช้ความถนัดของตนเต็มที่
                                      - ชอบสงสัย วิพากวิจารณ์ และคิดเชิง
                                      วิเคราะห์อยู่เสมอ " >
                                      
                                      </li>
          
          <!--  4************************************************************************************************************************************4  -->
                                    @elseif(($i<$e) && ($s<$n) && ($t<$f) && ($j<$p))
          
                                     <input type="text" name="conclude" value="ENFP" hidden/>
                                     <li class="list-group-item">ท่านได้คะแนนคือ <label>ENFP </label>คุณลักษณะบุคลิกภาพ
                                      <br>- กระตือรือร้น อบอุ่น มีใจนักกีฬา เฉลียว
                                      ฉลาดและมีจินตนาการ สามารถทำงานได้ทุก
                                      อย่างถ้าตนสนใจ สามารถแก้ปัญหายากๆ ได้
                                      อย่างรวดเร็ว และเต็มใจช่วยคนอื่นแก้ปัญหา
                                      จึงมักใช้ความสามารถแก้ปัญหาเฉพาะหน้าอยู่
                                      บ่อยๆ มากกว่าต้องเตรียมการมาล่วงหน้า
                                      สามารถหาเหตุผลใดๆ มาบีบบังคับเพื่อให้ได้
                                      ดังใจปรารถนา
                                      - มีความต่อเนื่องและยืดหยุ่น เก่งวาทะการ
                                      และพูดกลอนสดได้ดี
                                      <input type="hidden" name="meaning" value="- กระตือรือร้น อบอุ่น มีใจนักกีฬา เฉลียว
                                      ฉลาดและมีจินตนาการ สามารถทำงานได้ทุก
                                      อย่างถ้าตนสนใจ สามารถแก้ปัญหายากๆ ได้
                                      อย่างรวดเร็ว และเต็มใจช่วยคนอื่นแก้ปัญหา
                                      จึงมักใช้ความสามารถแก้ปัญหาเฉพาะหน้าอยู่
                                      บ่อยๆ มากกว่าต้องเตรียมการมาล่วงหน้า
                                      สามารถหาเหตุผลใดๆ มาบีบบังคับเพื่อให้ได้
                                      ดังใจปรารถนา
                                      - มีความต่อเนื่องและยืดหยุ่น เก่งวาทะการ
                                      และพูดกลอนสดได้ดี" >
                                    
                                    
                                    </li>
          
                                     @elseif(($i<$e) && ($s<$n) && ($t>$f) && ($j<$p))
          
                                     <input type="text" name="conclude" value="ENTP" hidden/>
                                     <li class="list-group-item">ท่านได้คะแนนคือ <label>ENTP </label>คุณลักษณะบุคลิกภาพ
                                      <br>- รวดเร็ว เฉลียวฉลาด เก่งรอบด้าน มัก
                                      กระตุ้นบริษัทให้ตื่นตัว ชอบการพูด เปิดเผย
                                      ตรงไปตรงมา บางครั้งพูดแง่มุมให้เกิด
                                      บรรยากาศขบขัน เป็นแหล่งความรู้ให้คนอื่น
                                      ในการแก้ปัญหาใหม่ที่มีความท้าทาย แต่มัก
                                      บกพร่องเรื่องงานประจำ เพราะชอบเปลี่ยน
                                      งานอยู่ตลอดเวลา สามารถอ้างเหตุผลใน
                                      ประเด็นที่ตนต้องการได้เสมอ
                                      - เบื่องานประจำที่จำเจ ความสนใจมักเปลี่ยน
                                      ได้ตลอดเวลา 
                                    
                                      <input type="hidden" name="meaning" value="- รวดเร็ว เฉลียวฉลาด เก่งรอบด้าน มัก
                                      กระตุ้นบริษัทให้ตื่นตัว ชอบการพูด เปิดเผย
                                      ตรงไปตรงมา บางครั้งพูดแง่มุมให้เกิด
                                      บรรยากาศขบขัน เป็นแหล่งความรู้ให้คนอื่น
                                      ในการแก้ปัญหาใหม่ที่มีความท้าทาย แต่มัก
                                      บกพร่องเรื่องงานประจำ เพราะชอบเปลี่ยน
                                      งานอยู่ตลอดเวลา สามารถอ้างเหตุผลใน
                                      ประเด็นที่ตนต้องการได้เสมอ
                                      - เบื่องานประจำที่จำเจ ความสนใจมักเปลี่ยน
                                      ได้ตลอดเวลา" >
                                    
                                    </li>
                                     
                                     @elseif(($i<$e) && ($s<$n) && ($t<$f) && ($j>$p))
          
                                     <input type="text" name="conclude" value="ENFJ" hidden/>
                                     <li class="list-group-item">ท่านได้คะแนนคือ <label>ENFJ </label>คุณลักษณะบุคลิกภาพ
                                      <br>- ชอบตอบสนองและมีความรับผิดชอบ รู้สึก
                                      เอื้ออาทรต่อความคิดและความต้องการของ
                                      ผู้อื่นอย่างจริงใจ การปฏิบัติงานจึงมักระมัด
                                      ระวังมิให้กระทบต่อความรู้สึกของผู้อื่น เก่ง
                                      ในการเป็นผู้นำการอภิปราย หรือนำเสนอเค้า
                                      โครงการได้อย่างชัดเจน นุ่มนวล เก่งสังคม
                                      กว้างขวาง เป็นนักกิจกรรมที่ดีของโรงเรียน
                                      ซึ่งสามารถจัดเวลาให้กับการเรียนและการทำ
                                      กิจกรรมได้อย่างเหมาะสม ลงตัว
                                      - เป็นผู้นำที่เข้ากับคนได้ เก่งชอบช่วยเหลือ
                                      สนับสนุนคนอื่นในกลุ่ม และสามารถสร้าง
                                      แรงดลใจให้ผู้อื่นได้ดี 
                                     
                                      <input type="hidden" name="meaning" value="- ชอบตอบสนองและมีความรับผิดชอบ รู้สึก
                                      เอื้ออาทรต่อความคิดและความต้องการของ
                                      ผู้อื่นอย่างจริงใจ การปฏิบัติงานจึงมักระมัด
                                      ระวังมิให้กระทบต่อความรู้สึกของผู้อื่น เก่ง
                                      ในการเป็นผู้นำการอภิปราย หรือนำเสนอเค้า
                                      โครงการได้อย่างชัดเจน นุ่มนวล เก่งสังคม
                                      กว้างขวาง เป็นนักกิจกรรมที่ดีของโรงเรียน
                                      ซึ่งสามารถจัดเวลาให้กับการเรียนและการทำ
                                      กิจกรรมได้อย่างเหมาะสม ลงตัว
                                      - เป็นผู้นำที่เข้ากับคนได้ เก่งชอบช่วยเหลือ
                                      สนับสนุนคนอื่นในกลุ่ม และสามารถสร้าง
                                      แรงดลใจให้ผู้อื่นได้ดี " >
                              
                                    </li>
                                     @elseif(($i<$e) && ($s<$n) && ($t>$f) && ($j>$p))
                                     <input type="text" name="conclude" value="ENTJ" hidden/>
                                     <li class="list-group-item">ท่านได้คะแนนคือ <label>ENTJ </label>คุณลักษณะบุคลิกภาพ
                                      <br>- อบอุ่น มีไมตรีจิต จริงใจ เรียนเก่งเป็นผู้นำ
                                      กิจกรรม มีความสามารถสูงในด้านกิจกรรม
                                      ประเภทใช้ความคิดหรือเหตุผล เฉลียวฉลาด
                                      ในการเจรจาต่าง ๆ เป็นคนทันโลกและชอบ
                                      ใฝ่รู้ ใฝ่เรียนอยู่ตลอดเวลา บางครั้งมักมองสิ่ง
                                      ต่างๆ เชิงบวกและมั่นใจมากเกินกว่าความเป็น
                                      จริง
                                      - มักกดดันผู้อื่นให้ยอมรับความคิดเห็นของ
                                      ตน
                                      <input type="hidden" name="meaning" value="- อบอุ่น มีไมตรีจิต จริงใจ เรียนเก่งเป็นผู้นำ
                                      กิจกรรม มีความสามารถสูงในด้านกิจกรรม
                                      ประเภทใช้ความคิดหรือเหตุผล เฉลียวฉลาด
                                      ในการเจรจาต่าง ๆ เป็นคนทันโลกและชอบ
                                      ใฝ่รู้ ใฝ่เรียนอยู่ตลอดเวลา บางครั้งมักมองสิ่ง
                                      ต่างๆ เชิงบวกและมั่นใจมากเกินกว่าความเป็น
                                      จริง
                                      - มักกดดันผู้อื่นให้ยอมรับความคิดเห็นของ
                                      ตน" >
                                    </li>
                                     @endif
                                    </ul>
                                    @if( ($s>$n) && ($t>$f)   )
                                    <ul class="list-group-item">
                                    
                                        การคิด <label>ST</label>คุณลักษณะบุคลิกภาพ
                                        <br>-สร้างระเบียบกฏเกณฑ์
                                        -สนใจข้อมูลตัวเลข
                                        -ตัดสินใจได้ดีโดยยึดข้อเท็จจริง
                                        -เน้นเรื่องประสิทธิผลและประสิทธิภาพ
                                        -ผลักดันให้ทุกคนตรงประเด็น
                                        -ให้และรับรางวัลเป็นรูปธรรม
                                        -ไมอดทนต่อการรอค่อย 
                                        -ด่วนสรุปอย่างรวดเร็ว
                                        -เครียดเมื่องานไม่ป็นไปตามแผน

                                        <input type="hidden" name="concludetwo" value=" -สร้างระเบียบกฏเกณฑ์
                                        -สนใจข้อมูลตัวเลข
                                        -ตัดสินใจได้ดีโดยยึดข้อเท็จจริง
                                        -เน้นเรื่องประสิทธิผลและประสิทธิภาพ
                                        -ผลักดันให้ทุกคนตรงประเด็น
                                        -ให้และรับรางวัลเป็นรูปธรรม
                                        -ไมอดทนต่อการรอค่อย 
                                        -ด่วนสรุปอย่างรวดเร็ว
                                        -เครียดเมื่องานไม่ป็นไปตามแผน"/>
                                     
                                    </ul>
                                   @elseif(($n>$s) && ($f>$t))
                                   <ul class="list-group-item">
                                    
                                      การคิด <label>NF</label>คุณลักษณะบุคลิกภาพ
                                      <br>-ท่วงทีสง่างามน่าเลื่อมใสและผูกพันต่อผู้อื่น
                                      -นักสื่อสารที่ดี
                                      -เผชิญกับภาวะผันผวนและการเปลียนแปลงได้อย่างสบายใจ
                                      -มีวามอดทนต่อภาวะสลับซับซ้อนได้ดี
                                      -เปิดตนเองสู่ความคิดและการเปลี่ยนแปลงใหม่ๆ
                                      -มีความสัมพันธ์ที่ดีต่อผู้อื่น
                                      -ต้องารวามคิดเห็นด้วยจาดผู้อื่นมากกว่าเกินไป
                                      -มีปัญหาการเสนอความคิด



                                      <input type="hidden" name="concludetwo" value=" 
                                      -ท่วงทีสง่างามน่าเลื่อมใสและผูกพันต่อผู้อื่น
                                      -นักสื่อสารที่ดี
                                      -เผชิญกับภาวะผันผวนและการเปลียนแปลงได้อย่างสบายใจ
                                      -มีวามอดทนต่อภาวะสลับซับซ้อนได้ดี
                                      -เปิดตนเองสู่ความคิดและการเปลี่ยนแปลงใหม่ๆ
                                      -มีความสัมพันธ์ที่ดีต่อผู้อื่น
                                      -ต้องารวามคิดเห็นด้วยจาดผู้อื่นมากกว่าเกินไป
                                      -มีปัญหาการเสนอความคิด" />
                                   
                                  </ul>


                                  @elseif(($s>$n) && ($f>$t))
                                  <ul class="list-group-item">
                                   
                                     การคิด <label>SF</label>คุณลักษณะบุคลิกภาพ
                                     <br>-ชอบปฏิบัติและมีวิธีการ
                                     -นักแก้ไขปัญหาเชิงการพูด
                                     -มีระบบการทำงานที่ดี
                                     -เข้าใจองค์การได้ดี
                                     -ตอบสนองต่อวามคิดรูปธรรมได้ดี
                                     -ทายใจได้ง่ายและเข้ากับนอื่นได้ดี
                                     -ทายใจได้ง่ายและเข้ากับคนอื่นได้ดี
                                     -ชอบรางวัลที่มีผลงานมากกว่าเรื่องความพยายาม
                                     -ไม่เตมใจรับการเปลี่ยนแปลง
                                     -พึ่งกฏระเบียบมากเกินไป
                                     -มุ่งปัจจุบันมากเกินไป

                                     <input type="hidden" name="concludetwo" value=" -ชอบปฏิบัติและมีวิธีการ
                                     -นักแก้ไขปัญหาเชิงการพูด
                                     -มีระบบการทำงานที่ดี
                                     -เข้าใจองค์การได้ดี
                                     -ตอบสนองต่อวามคิดรูปธรรมได้ดี
                                     -ทายใจได้ง่ายและเข้ากับนอื่นได้ดี
                                     -ทายใจได้ง่ายและเข้ากับคนอื่นได้ดี
                                     -ชอบรางวัลที่มีผลงานมากกว่าเรื่องความพยายาม
                                     -ไม่เตมใจรับการเปลี่ยนแปลง
                                     -พึ่งกฏระเบียบมากเกินไป
                                     -มุ่งปัจจุบันมากเกินไป" />
                                 </ul>

                                 @elseif(($n>$s) && ($t>$f))
                                   <ul class="list-group-item">
                                      การคิด <label>NT</label>คุณลักษณะบุคลิกภาพ
                                      <br>-ออกแบบสะท้อนความคิดและความก้าวหน้า
                                      -มองเห็นความสัมพันธ์ของส่วนต่างๆ
                                      -เน้นความเป็นไปได้และวิเคราะห์ได้เที่ยงตรง  
                                      -เป็นตัวการของการเปลี่ยนแปลง
                                      -ตอบสนองต่อความริเริ่มใหม่ๆ
                                      -เปืดเผยตรงไปตรงมา
                                      -สนใจกิจกรรมประเทืองปัญญา
                                      -สนใจต่อการแก้ไขปัญหา
                                      -ขาดวามระมัดระวังต่อความรู้สึกคนอื่น
                                      -ตัดสินผู้อื่นด้วยผลสัมฤทธิ์ทางวิชาการ
                                      -คาดความหมายแท้ไม่มีเหตุผลเพียงพอ

                                      <input type="hidden" name="concludetwo" value=" -ออกแบบสะท้อนความคิดและความก้าวหน้า
                                      -มองเห็นความสัมพันธ์ของส่วนต่างๆ
                                      -เน้นความเป็นไปได้และวิเคราะห์ได้เที่ยงตรง  
                                      -เป็นตัวการของการเปลี่ยนแปลง
                                      -ตอบสนองต่อความริเริ่มใหม่ๆ
                                      -เปืดเผยตรงไปตรงมา
                                      -สนใจกิจกรรมประเทืองปัญญา
                                      -สนใจต่อการแก้ไขปัญหา
                                      -ขาดวามระมัดระวังต่อความรู้สึกคนอื่น
                                      -ตัดสินผู้อื่นด้วยผลสัมฤทธิ์ทางวิชาการ
                                      -คาดความหมายแท้ไม่มีเหตุผลเพียงพอ" />
                                      
                                   
                                  </ul>


                                    @endif











                              </div>
                              <center>
                                  {{ Form::submit('บันทึก',['class'=> 'btn btn-success'])}}
                            {{Form::close()}}
                         
                                </center>
                        </div>
                    </div>
                  </div> 
@endsection